{
	"machine-learning-835": {
		"subject": "cs",
		"overview": "Machine learning is the science of getting computers to act without being explicitly programmed. In the past decade, machine learning has given us self-driving cars, practical speech recognition, effective web search, and a vastly improved understanding of the human genome. Machine learning is so pervasive today that you probably use it dozens of times a day without knowing it. Many researchers also think it is the best way to make progress towards human-level AI. In this class, you will learn about the most effective machine learning techniques, and gain practice implementing them and getting them to work for yourself. More importantly, you'll learn about not only the theoretical underpinnings of learning, but also gain the practical know-how needed to quickly and powerfully apply these techniques to new problems. Finally, you'll learn about some of Silicon Valley's best practices in innovation as it pertains to machine learning and AI.\n\nThis course provides a broad introduction to machine learning, datamining, and statistical pattern recognition. Topics include: (i) Supervised learning (parametric/non-parametric algorithms, support vector machines, kernels, neural networks). (ii) Unsupervised learning (clustering, dimensionality reduction, recommender systems, deep learning). (iii) Best practices in machine learning (bias/variance theory; innovation process in machine learning and AI). The course will also draw from numerous case studies and applications, so that you'll also learn how to apply learning algorithms to building smart robots (perception, control), text understanding (web search, anti-spam), computer vision, medical informatics, audio, database mining, and other areas.",
		"name": "Machine Learning",
		"school": "Stanford University",
		"provider": "Coursera",
		"categories": [
			"Machine Learning",
			"Artificial Intelligence",
			"Supervised Learning"
		],
		"rating": "",
		"syllabus": "Introduction\n-Welcome to Machine Learning! In this module, we introduce the core idea of teaching a computer to learn concepts using data—without being explicitly programmed. The Course Wiki is under construction. Please visit the resources tab for the most complete and up-to-date information.\n\nLinear Regression with One Variable\n-Linear regression predicts a real-valued output based on an input value. We discuss the application of linear regression to housing price prediction, present the notion of a cost function, and introduce the gradient descent method for learning.\n\nLinear Algebra Review\n-This optional module provides a refresher on linear algebra concepts. Basic understanding of linear algebra is necessary for the rest of the course, especially as we begin to cover models with multiple variables.\n\nLinear Regression with Multiple Variables\n-\nWhat if your input has more than one value? In this module, we show how linear regression can be extended to accommodate multiple input features. We also discuss best practices for implementing linear regression.\n\nOctave/Matlab Tutorial\n-This course includes programming assignments designed to help you understand how to implement the learning algorithms in practice. To complete the programming assignments, you will need to use Octave or MATLAB. This module introduces Octave/Matlab and shows you how to submit an assignment.\n\nLogistic Regression\n-Logistic regression is a method for classifying data into discrete outcomes. For example, we might use logistic regression to classify an email as spam or not spam. In this module, we introduce the notion of classification, the cost function for logistic regression, and the application of logistic regression to multi-class classification.\n\n\nRegularization\n-Machine learning models need to generalize well to new examples that the model has not seen in practice. In this module, we introduce regularization, which helps prevent models from overfitting the training data.\n\nNeural Networks: Representation\n-Neural networks is a model inspired by how the brain works. It is widely used today in many applications: when your phone interprets and understand your voice commands, it is likely that a neural network is helping to understand your speech; when you cash a check, the machines that automatically read the digits also use neural networks.\n\nNeural Networks: Learning\n-In this module, we introduce the backpropagation algorithm that is used to help learn parameters for a neural network. At the end of this module, you will be implementing your own neural network for digit recognition.\n\n\nAdvice for Applying Machine Learning\n-Applying machine learning in practice is not always straightforward. In this module, we share best practices for applying machine learning in practice, and discuss the best ways to evaluate performance of the learned models.\n\n\nMachine Learning System Design\n-To optimize a machine learning algorithm, you’ll need to first understand where the biggest improvements can be made. In this module, we discuss how to understand the performance of a machine learning system with multiple parts, and also how to deal with skewed data.\n\n\nSupport Vector Machines\n-Support vector machines, or SVMs, is a machine learning algorithm for classification. We introduce the idea and intuitions behind SVMs and discuss how to use it in practice.\n\n\nUnsupervised Learning\n-We use unsupervised learning to build models that help us understand our data better. We discuss the k-Means algorithm for clustering that enable us to learn groupings of unlabeled data points.\n\nDimensionality Reduction\n-In this module, we introduce Principal Components Analysis, and show how it can be used for data compression to speed up learning algorithms as well as for visualizations of complex datasets.\n\n\nAnomaly Detection\n-Given a large number of data points, we may sometimes want to figure out which ones vary significantly from the average. For example, in manufacturing, we may want to detect defects or anomalies. We show how a dataset can be modeled using a Gaussian distribution, and how the model can be used for anomaly detection.\n\n\nRecommender Systems\n-When you buy a product online, most websites automatically recommend other products that you may like. Recommender systems look at patterns of activities between different users and different products to produce these recommendations. In this module, we introduce recommender algorithms such as the collaborative filtering algorithm and low-rank matrix factorization.\n\nLarge Scale Machine Learning\n-Machine learning works best when there is an abundance of data to leverage for training. In this module, we discuss how to apply the machine learning algorithms with large datasets.\n\nApplication Example: Photo OCR\n-Identifying and recognizing objects, words, and digits in an image is a challenging task. We discuss how a pipeline can be built to tackle this problem and how to analyze and improve the performance of such a system.",
		"teachers": ["Andrew Ng"],
		"details": {
			"PROVIDER": "Coursera",
			"COST": "Free Online Course (Audit)",
			"SESSION": "Upcoming",
			"LANGUAGE": "English",
			"CERTIFICATE": "Paid Certificate Available",
			"EFFORT": "5-7 hours a week",
			"START DATE": [
				"28th Oct, 2019",
				"14th Oct, 2019",
				"30th Sep, 2019",
				"16th Sep, 2019",
				"2nd Sep, 2019",
				"19th Aug, 2019",
				"5th Aug, 2019",
				"22nd Jul, 2019",
				"8th Jul, 2019",
				"24th Jun, 2019",
				"10th Jun, 2019",
				"27th May, 2019",
				"13th May, 2019",
				"29th Apr, 2019",
				"15th Apr, 2019",
				"1st Apr, 2019",
				"18th Mar, 2019",
				"4th Mar, 2019",
				"18th Feb, 2019",
				"4th Feb, 2019",
				"21st Jan, 2019",
				"7th Jan, 2019",
				"24th Dec, 2018",
				"10th Dec, 2018",
				"26th Nov, 2018",
				"12th Nov, 2018",
				"29th Oct, 2018",
				"15th Oct, 2018",
				"1st Oct, 2018",
				"17th Sep, 2018",
				"3rd Sep, 2018",
				"20th Aug, 2018",
				"6th Aug, 2018",
				"23rd Jul, 2018",
				"9th Jul, 2018",
				"25th Jun, 2018",
				"11th Jun, 2018",
				"28th May, 2018",
				"14th May, 2018",
				"30th Apr, 2018",
				"16th Apr, 2018",
				"2nd Apr, 2018",
				"19th Mar, 2018",
				"5th Mar, 2018",
				"19th Feb, 2018",
				"5th Feb, 2018",
				"22nd Jan, 2018",
				"8th Jan, 2018",
				"25th Dec, 2017",
				"11th Dec, 2017",
				"27th Nov, 2017",
				"13th Nov, 2017",
				"30th Oct, 2017",
				"16th Oct, 2017",
				"2nd Oct, 2017",
				"18th Sep, 2017",
				"4th Sep, 2017",
				"21st Aug, 2017",
				"7th Aug, 2017",
				"24th Jul, 2017",
				"10th Jul, 2017",
				"26th Jun, 2017",
				"12th Jun, 2017",
				"29th May, 2017",
				"15th May, 2017",
				"1st May, 2017",
				"17th Apr, 2017",
				"3rd Apr, 2017",
				"20th Mar, 2017",
				"6th Mar, 2017",
				"20th Feb, 2017",
				"6th Feb, 2017",
				"23rd Jan, 2017",
				"9th Jan, 2017",
				"26th Dec, 2016",
				"12th Dec, 2016",
				"28th Nov, 2016",
				"14th Nov, 2016",
				"31st Oct, 2016",
				"17th Oct, 2016",
				"3rd Oct, 2016",
				"19th Sep, 2016",
				"5th Sep, 2016",
				"22nd Aug, 2016",
				"8th Aug, 2016",
				"25th Jul, 2016",
				"11th Jul, 2016",
				"27th Jun, 2016",
				"13th Jun, 2016",
				"30th May, 2016",
				"16th May, 2016",
				"2nd May, 2016",
				"18th Apr, 2016",
				"4th Apr, 2016",
				"21st Mar, 2016",
				"7th Mar, 2016",
				"8th Feb, 2016",
				"22nd Feb, 2016",
				"25th Jan, 2016",
				"28th Dec, 2015",
				"30th Nov, 2015",
				"2nd Nov, 2015",
				"5th Oct, 2015",
				"18th Sep, 2015",
				"2015",
				"19th Jan, 2015",
				"22nd Sep, 2014",
				"16th Jun, 2014",
				"3rd Mar, 2014",
				"14th Oct, 2013",
				"22nd Apr, 2013",
				"20th Aug, 2012",
				"23rd Apr, 2012",
				"Oct, 2011"
			],
			"DURATION": "11 weeks long"
		},
		"link": "http://click.linksynergy.com/fs-bin/click?id=SAyYsTvLiGQ&subid=&offerid=451430.1&type=10&tmpid=18061&RD_PARM1=https%3A%2F%2Fwww.coursera.org%2Flearn%2Fmachine-learning&u1=gtc_direct"
	},
	"independent-elements-of-ai-12469": {
		"subject": "cs",
		"overview": "The goal of this course is to demystify AI\nThe elements of AI is a free online course for everyone interested in learning what AI is, what is possible (and not possible) with AI, and how it affects our lives – with no complicated math or programming required. By completing the course you can earn a LinkedIn certificate. People in Finland can also earn 2 ECTS credits through the Open University. The course is available from May 14, 2018.\nAfter taking the course, you will be able to:\nUnderstand some of the major implications of AI\nThink critically about AI news and claims \nDefine and discuss what AI is\nExplain the methods that make AI possible\n ",
		"name": "Elements of AI",
		"school": "University of Helsinki",
		"provider": "Independent",
		"categories": ["Artificial Intelligence"],
		"rating": "",
		"syllabus": "Part 1\nWhat is AI?\nPart 2\nSolving problems with AI\nPart 3\nReal world AI\nPart 4\nMachine learning\nPart 5\nNeural networks\nPart 6\nImplications\n ",
		"teachers": [],
		"details": {
			"PROVIDER": "Independent",
			"COST": "Free Online Course",
			"SESSION": "Self Paced",
			"LANGUAGE": "English",
			"CERTIFICATE": "Certificate Available",
			"EFFORT": "5-10 hours a week",
			"START DATE": ["Self paced"],
			"DURATION": "6 weeks long"
		},
		"link": "http://www.elementsofai.com/"
	},
	"edx-introduction-to-computer-science-and-programming-using-python-1341": {
		"subject": "cs",
		"overview": "This course is the first of a two-course sequence: Introduction to Computer Science and Programming Using Python, and Introduction to Computational Thinking and Data Science. Together, they are designed to help people with no prior exposure to computer science or programming learn to think computationally and write programs to tackle useful problems. Some of the people taking the two courses will use them as a stepping stone to more advanced computer science courses, but for many it will be their first and last computer science courses. This run features lecture videos, lecture exercises, and problem sets using Python 3.5. Even if you previously took the course with Python 2.7, you will be able to easily transition to Python 3.5 in future courses, or enroll now to refresh your learning.\nSince these courses may be the only formal computer science courses many of the students take, we have chosen to focus on breadth rather than depth. The goal is to provide students with a brief introduction to many topics so they will have an idea of what is possible when they need to think about how to use computation to accomplish some goal later in their career. That said, they are not \"computation appreciation\" courses. They are challenging and rigorous courses in which the students spend a lot of time and effort learning to bend the computer to their will.",
		"name": "Introduction to Computer Science and Programming Using Python",
		"school": "Massachusetts Institute of Technology",
		"provider": "edX",
		"categories": ["Computer Science"],
		"rating": "",
		"syllabus": null,
		"teachers": ["Ana Bell", "Eric Grimson", "John Guttag"],
		"details": {
			"PROVIDER": "edX",
			"COST": "Free Online Course (Audit)",
			"SESSION": "Upcoming",
			"LANGUAGE": "English",
			"EFFORT": "14-16 hours a week",
			"START DATE": [
				"22nd Jan, 2020",
				"28th Aug, 2019",
				"Self paced",
				"22nd Jan, 2019",
				"30th Aug, 2018",
				"30th Aug, 2017",
				"30th May, 2017",
				"10th Jan, 2017",
				"30th Aug, 2016",
				"7th Jun, 2016",
				"13th Jan, 2016",
				"26th Aug, 2015",
				"10th Jun, 2015",
				"27th Aug, 2014",
				"11th Jun, 2014",
				"19th Feb, 2014",
				"16th Oct, 2013"
			],
			"DURATION": "9 weeks long"
		},
		"link": "http://www.awin1.com/awclick.php?gid=295463&mid=6798&awinaffid=301045&linkid=599979&p=https%3A%2F%2Fwww.edx.org%2Fcourse%2F6-00-1x-introduction-to-computer-science-and-programming-using-python-4&clickref=gtc_direct"
	}
}
